app/views/leaderboards/index.html.erb

          <div class="flex-1">
            <%= form.select :search,
                options_for_select([['All Players', '']] + Leaderboard.pluck(:name).map { |name| [name, name] }),
                { selected: params[:search], prompt: 'Search by player name...' },
                { id: 'player-select', class: 'w-full h-12 px-4 border border-gray-300 rounded-lg focus:ring-2 focus:ring-blue-500 focus:border-blue-500 shadow-sm bg-white text-gray-900 placeholder-gray-500 font-medium' } %>
---
SELECT "leaderboards"."name" FROM "leaderboards"