app/controllers/leaderboards_controller.rb

SELECT "leaderboards".* FROM "leaderboards" WHERE (LOWER(name) LIKE LOWER('%crypto%')) ORDER BY "leaderboards"."rank" ASC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "leaderboards" WHERE (LOWER(name) LIKE LOWER('%4%'))
---
  def index
    @leaderboards = Leaderboard.by_rank

    # Apply search filter
    if params[:search].present?
      @leaderboards = @leaderboards.search_by_name(params[:search])
    end

    # Pagination with per_page parameter
    per_page = params[:per_page]&.to_i || 10
    per_page = [ 10, 25, 50, 100 ].include?(per_page) ? per_page : 10 # Validate per_page
    @leaderboards = @leaderboards.page(params[:page]).per(per_page)

SELECT "leaderboards".* FROM "leaderboards" ORDER BY "leaderboards"."rank" ASC
---
  def export
    @leaderboards = Leaderboard.by_rank

    # Apply search filter if present
    if params[:search].present?
      @leaderboards = @leaderboards.search_by_name(params[:search])
    end

    # Convert to JSON format
    data = @leaderboards.map do |leaderboard|